#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.git_net_1.aci_epgs_using_function.epg_to_aep_assign: Refreshing state... [id=uni/infra/attentp-github_project/gen-default/rsfuncToEpg-[uni/tn-github_project/ap-git_net_1_ap/epg-git_net_1_epg]]
module.git_net_1.aci_access_generic.epg_to_aep: Refreshing state... [id=uni/infra/attentp-github_project/gen-default]
module.git_net_1.aci_attachable_access_entity_profile.github_project: Refreshing state... [id=uni/infra/attentp-github_project]
module.git_net_2.aci_application_profile.github_project: Refreshing state... [id=uni/tn-github_project/ap-git_net_2_ap]
module.git_net_2.aci_attachable_access_entity_profile.github_project: Refreshing state... [id=uni/infra/attentp-github_project]
module.git_net_1.aci_tenant.github_project: Refreshing state... [id=uni/tn-github_project]
module.git_net_1.aci_bridge_domain.github_project: Refreshing state... [id=uni/tn-github_project/BD-vlan_15_bd]
module.git_net_2.aci_ranges.vlan_2_50_range: Refreshing state... [id=uni/infra/vlanns-[github_project_pool]-static/from-[vlan-2]-to-[vlan-50]]
module.git_net_1.aci_application_epg.github_project: Refreshing state... [id=uni/tn-github_project/ap-git_net_1_ap/epg-git_net_1_epg]
module.git_net_1.aci_vrf.github_project: Refreshing state... [id=uni/tn-github_project/ctx-github_project]
module.git_net_1.aci_physical_domain.github_project: Refreshing state... [id=uni/phys-github_project]
module.git_net_2.aci_bridge_domain.github_project: Refreshing state... [id=uni/tn-github_project/BD-vlan_16_bd]
module.git_net_2.aci_epg_to_domain.net_2_domain: Refreshing state... [id=uni/tn-github_project/ap-git_net_2_ap/epg-git_net_2_epg/rsdomAtt-[uni/phys-github_project]]
module.git_net_1.aci_epg_to_domain.net_2_domain: Refreshing state... [id=uni/tn-github_project/ap-git_net_1_ap/epg-git_net_1_epg/rsdomAtt-[uni/phys-github_project]]
module.git_net_2.aci_epgs_using_function.epg_to_aep_assign: Refreshing state... [id=uni/infra/attentp-github_project/gen-default/rsfuncToEpg-[uni/tn-github_project/ap-git_net_2_ap/epg-git_net_2_epg]]
module.git_net_2.aci_subnet.subnet: Refreshing state... [id=uni/tn-github_project/ap-git_net_2_ap/epg-git_net_2_epg/subnet-[192.168.16.1/24]]
module.git_net_1.aci_vlan_pool.github_project: Refreshing state... [id=uni/infra/vlanns-[github_project_pool]-static]
module.git_net_2.aci_vlan_pool.github_project: Refreshing state... [id=uni/infra/vlanns-[github_project_pool]-static]
module.git_net_1.aci_application_profile.github_project: Refreshing state... [id=uni/tn-github_project/ap-git_net_1_ap]
module.git_net_2.aci_vrf.github_project: Refreshing state... [id=uni/tn-github_project/ctx-github_project]
module.git_net_2.aci_application_epg.github_project: Refreshing state... [id=uni/tn-github_project/ap-git_net_2_ap/epg-git_net_2_epg]
module.git_net_2.aci_tenant.github_project: Refreshing state... [id=uni/tn-github_project]
module.git_net_1.aci_subnet.subnet: Refreshing state... [id=uni/tn-github_project/ap-git_net_1_ap/epg-git_net_1_epg/subnet-[192.168.15.1/24]]
module.git_net_1.aci_ranges.vlan_2_50_range: Refreshing state... [id=uni/infra/vlanns-[github_project_pool]-static/from-[vlan-2]-to-[vlan-50]]
module.git_net_2.aci_access_generic.epg_to_aep: Refreshing state... [id=uni/infra/attentp-github_project/gen-default]
module.git_net_2.aci_physical_domain.github_project: Refreshing state... [id=uni/phys-github_project]
module.common.data.aci_tenant.common: Reading...
module.common.data.aci_tenant.common: Read complete after 0s [id=uni/tn-common]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.common.aci_access_generic.epg_to_aep will be created
  + resource "aci_access_generic" "epg_to_aep" {
      + annotation                          = "orchestrator:terraform"
      + attachable_access_entity_profile_dn = (known after apply)
      + description                         = (known after apply)
      + id                                  = (known after apply)
      + name                                = "default"
      + name_alias                          = (known after apply)
    }

  # module.common.aci_attachable_access_entity_profile.github_project will be created
  + resource "aci_attachable_access_entity_profile" "github_project" {
      + annotation              = "orchestrator:terraform"
      + description             = (known after apply)
      + id                      = (known after apply)
      + name                    = "github_project"
      + name_alias              = (known after apply)
      + relation_infra_rs_dom_p = (known after apply)
    }

  # module.common.aci_physical_domain.github_project will be created
  + resource "aci_physical_domain" "github_project" {
      + annotation                         = "orchestrator:terraform"
      + id                                 = (known after apply)
      + name                               = "github_project"
      + name_alias                         = (known after apply)
      + relation_infra_rs_dom_vxlan_ns_def = (known after apply)
      + relation_infra_rs_vlan_ns          = (known after apply)
      + relation_infra_rs_vlan_ns_def      = (known after apply)
    }

  # module.common.aci_ranges.vlan_2_50_range will be created
  + resource "aci_ranges" "vlan_2_50_range" {
      + alloc_mode   = "static"
      + annotation   = "orchestrator:terraform"
      + description  = (known after apply)
      + from         = "vlan-2"
      + id           = (known after apply)
      + name_alias   = (known after apply)
      + role         = (known after apply)
      + to           = "vlan-50"
      + vlan_pool_dn = (known after apply)
    }

  # module.common.aci_tenant.github_project will be created
  + resource "aci_tenant" "github_project" {
      + annotation                    = "orchestrator:terraform"
      + description                   = "Tenant for github_project"
      + id                            = (known after apply)
      + name                          = "github_project"
      + name_alias                    = (known after apply)
      + relation_fv_rs_tenant_mon_pol = (known after apply)
    }

  # module.common.aci_vlan_pool.github_project will be created
  + resource "aci_vlan_pool" "github_project" {
      + alloc_mode  = "static"
      + annotation  = "orchestrator:terraform"
      + description = (known after apply)
      + id          = (known after apply)
      + name        = "github_project_pool"
      + name_alias  = (known after apply)
    }

  # module.common.aci_vrf.github_project will be created
  + resource "aci_vrf" "github_project" {
      + annotation                              = "orchestrator:terraform"
      + bd_enforced_enable                      = (known after apply)
      + description                             = "VRF for github_project"
      + id                                      = (known after apply)
      + ip_data_plane_learning                  = (known after apply)
      + knw_mcast_act                           = (known after apply)
      + name                                    = "github_project"
      + name_alias                              = (known after apply)
      + pc_enf_dir                              = (known after apply)
      + pc_enf_pref                             = (known after apply)
      + relation_fv_rs_bgp_ctx_pol              = (known after apply)
      + relation_fv_rs_ctx_to_ep_ret            = (known after apply)
      + relation_fv_rs_ctx_to_ext_route_tag_pol = (known after apply)
      + relation_fv_rs_ospf_ctx_pol             = (known after apply)
      + relation_fv_rs_vrf_validation_pol       = (known after apply)
      + tenant_dn                               = (known after apply)
    }

Plan: 7 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @kozhabergenova, Action: `pull_request`*